; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-3-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-5 - location
	p0-8 - location
	p1-0 - location
	p1-6 - location
	p2-5 - location
	p3-2 - location
	p4-1 - location
	p4-3 - location
	p4-9 - location
	p5-3 - location
	p5-7 - location
	p6-4 - location
	p8-0 - location
	p8-4 - location
	p8-10 - location
	p9-5 - location
	p9-6 - location
	p10-0 - location
	p10-7 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s0)
	(at driver3 s1)
	(at driver4 s9)
	(at driver5 s8)
	(at truck1 s9)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s10)
	(at package2 s0)
	(at package3 s6)
	(at package4 s2)
	(at package5 s2)
	(at package6 s7)
	(at package7 s5)
	(at package8 s1)
	(at package9 s1)
	(at package10 s1)
	(at package11 s2)
	(at package12 s2)
	(at package13 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(path s8 p8-10)
	(path p8-10 s8)
	(path s10 p8-10)
	(path p8-10 s10)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(path s10 p10-7)
	(path p10-7 s10)
	(path s7 p10-7)
	(path p10-7 s7)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 75)
	(= (time-to-drive s8 s0) 75)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 22)
	(= (time-to-drive s3 s1) 22)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 73)
	(= (time-to-drive s5 s1) 73)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 19)
	(= (time-to-drive s7 s1) 19)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 19)
	(= (time-to-drive s8 s1) 19)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 14)
	(= (time-to-drive s9 s1) 14)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 54)
	(= (time-to-drive s10 s1) 54)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 7)
	(= (time-to-drive s0 s2) 7)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 70)
	(= (time-to-drive s1 s2) 70)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 65)
	(= (time-to-drive s5 s2) 65)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 21)
	(= (time-to-drive s6 s2) 21)
	(link s2 s8)
	(link s8 s2)
	(= (time-to-drive s2 s8) 37)
	(= (time-to-drive s8 s2) 37)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 65)
	(= (time-to-drive s0 s3) 65)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 95)
	(= (time-to-drive s10 s3) 95)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 17)
	(= (time-to-drive s0 s4) 17)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 92)
	(= (time-to-drive s1 s4) 92)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 70)
	(= (time-to-drive s6 s4) 70)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 21)
	(= (time-to-drive s8 s4) 21)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 39)
	(= (time-to-drive s9 s4) 39)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 48)
	(= (time-to-drive s0 s5) 48)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 51)
	(= (time-to-drive s4 s5) 51)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 10)
	(= (time-to-drive s7 s5) 10)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 3)
	(= (time-to-drive s10 s5) 3)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 23)
	(= (time-to-drive s10 s6) 23)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 61)
	(= (time-to-drive s3 s7) 61)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 46)
	(= (time-to-drive s8 s7) 46)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 46)
	(= (time-to-drive s10 s8) 46)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 14)
	(= (time-to-drive s7 s10) 14)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 92)
	(= (time-to-drive s9 s10) 92)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s10)
	(at driver3 s10)
	(at driver4 s6)
	(at driver5 s7)
	(at truck1 s4)
	(at package2 s8)
	(at package3 s1)
	(at package4 s1)
	(at package5 s2)
	(at package6 s1)
	(at package7 s9)
	(at package8 s8)
	(at package9 s9)
	(at package12 s2)
	(at package13 s8)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 2 of 15
2. (drive-truck truck2 s1 s4 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 0 to 920
   goals met: 2 of 15
3. (load-truck package13 truck2 s4)
   deleted: (at package13 s4)
   added: (in package13 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 15
4. (drive-truck truck2 s4 s1 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 920 to 1932
   goals met: 2 of 15
5. (load-truck package9 truck2 s1)
   deleted: (at package9 s1)
   added: (in package9 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 15
6. (drive-truck truck2 s1 s10 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s10)
   changed: (fuel-used) from 1932 to 2634
   goals met: 2 of 15
7. (walk driver1 s4 p8-4)
   deleted: (at driver1 s4)
   added: (at driver1 p8-4)
   goals met: 2 of 15
8. (walk driver1 p8-4 s8)
   deleted: (at driver1 p8-4)
   added: (at driver1 s8)
   goals met: 2 of 15
9. (walk driver1 s8 p8-10)
   deleted: (at driver1 s8)
   added: (at driver1 p8-10)
   goals met: 2 of 15
10. (walk driver1 p8-10 s10)
   deleted: (at driver1 p8-10)
   added: (at driver1 s10)
   goals met: 3 of 15
11. (walk driver4 s9 p9-6)
   deleted: (at driver4 s9)
   added: (at driver4 p9-6)
   goals met: 3 of 15
12. (walk driver4 p9-6 s6)
   deleted: (at driver4 p9-6)
   added: (at driver4 s6)
   goals met: 4 of 15
13. (drive-truck truck2 s10 s7 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s7)
   changed: (fuel-used) from 2634 to 2816
   goals met: 4 of 15
14. (load-truck package6 truck2 s7)
   deleted: (at package6 s7)
   added: (in package6 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 4 of 15
15. (drive-truck truck2 s7 s8 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s8)
   changed: (fuel-used) from 2816 to 3552
   goals met: 4 of 15
16. (unload-truck package13 truck2 s8)
   deleted: (in package13 truck2)
   added: (at package13 s8)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 5 of 15
17. (drive-truck truck2 s8 s1 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   changed: (fuel-used) from 3552 to 3799
   goals met: 5 of 15
18. (unload-truck package6 truck2 s1)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 6 of 15
19. (load-truck package8 truck2 s1)
   deleted: (at package8 s1)
   added: (in package8 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 6 of 15
20. (drive-truck truck2 s1 s8 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s8)
   changed: (fuel-used) from 3799 to 4046
   goals met: 6 of 15
21. (unload-truck package8 truck2 s8)
   deleted: (in package8 truck2)
   added: (at package8 s8)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 7 of 15
22. (drive-truck truck2 s8 s2 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s2)
   changed: (fuel-used) from 4046 to 4453
   goals met: 7 of 15
23. (load-truck package4 truck2 s2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 7 of 15
24. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 4453 to 5363
   goals met: 7 of 15
25. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 8 of 15
26. (drive-truck truck2 s1 s9 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s9)
   changed: (fuel-used) from 5363 to 5517
   goals met: 8 of 15
27. (unload-truck package9 truck2 s9)
   deleted: (in package9 truck2)
   added: (at package9 s9)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 9 of 15
28. (walk driver5 s8 p8-10)
   deleted: (at driver5 s8)
   added: (at driver5 p8-10)
   goals met: 9 of 15
29. (walk driver5 p8-10 s10)
   deleted: (at driver5 p8-10)
   added: (at driver5 s10)
   goals met: 9 of 15
30. (walk driver5 s10 p10-7)
   deleted: (at driver5 s10)
   added: (at driver5 p10-7)
   goals met: 9 of 15
31. (walk driver5 p10-7 s7)
   deleted: (at driver5 p10-7)
   added: (at driver5 s7)
   goals met: 10 of 15
32. (drive-truck truck2 s9 s10 driver3)
   deleted: (at truck2 s9)
   added: (at truck2 s10)
   changed: (fuel-used) from 5517 to 6437
   goals met: 10 of 15
33. (walk driver4 s6 p9-6)
   deleted: (at driver4 s6)
   added: (at driver4 p9-6)
   goals met: 9 of 15
34. (drive-truck truck2 s10 s5 driver3)
   deleted: (at truck2 s10)
   added: (at truck2 s5)
   changed: (fuel-used) from 6437 to 6467
   goals met: 9 of 15
35. (load-truck package7 truck2 s5)
   deleted: (at package7 s5)
   added: (in package7 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 9 of 15
36. (drive-truck truck2 s5 s1 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 6467 to 7270
   goals met: 9 of 15
37. (walk driver4 p9-6 s6)
   deleted: (at driver4 p9-6)
   added: (at driver4 s6)
   goals met: 10 of 15
38. (drive-truck truck2 s1 s9 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s9)
   changed: (fuel-used) from 7270 to 7424
   goals met: 10 of 15
39. (unload-truck package7 truck2 s9)
   deleted: (in package7 truck2)
   added: (at package7 s9)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 11 of 15
40. (drive-truck truck2 s9 s1 driver3)
   deleted: (at truck2 s9)
   added: (at truck2 s1)
   changed: (fuel-used) from 7424 to 7564
   goals met: 11 of 15
41. (drive-truck truck2 s1 s8 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s8)
   changed: (fuel-used) from 7564 to 7754
   goals met: 11 of 15
42. (walk driver4 s6 p9-6)
   deleted: (at driver4 s6)
   added: (at driver4 p9-6)
   goals met: 10 of 15
43. (walk driver4 p9-6 s9)
   deleted: (at driver4 p9-6)
   added: (at driver4 s9)
   goals met: 10 of 15
44. (board-truck driver4 truck1 s9)
   deleted: (at driver4 s9) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 10 of 15
45. (drive-truck truck1 s9 s4 driver4)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   changed: (fuel-used) from 7754 to 8144
   goals met: 11 of 15
46. (drive-truck truck1 s4 s6 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (fuel-used) from 8144 to 8844
   goals met: 10 of 15
47. (load-truck package3 truck1 s6)
   deleted: (at package3 s6)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 10 of 15
48. (drive-truck truck1 s6 s4 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (fuel-used) from 8844 to 9614
   goals met: 11 of 15
49. (drive-truck truck2 s8 s10 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s10)
   changed: (fuel-used) from 9614 to 10074
   goals met: 11 of 15
50. (disembark-truck driver3 truck2 s10)
   deleted: (driving driver3 truck2)
   added: (at driver3 s10) (empty truck2)
   goals met: 12 of 15
51. (drive-truck truck1 s4 s1 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 10074 to 11086
   goals met: 11 of 15
52. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 12 of 15
53. (drive-truck truck1 s1 s4 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 11086 to 12006
   goals met: 13 of 15
54. (drive-truck truck1 s4 s6 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (fuel-used) from 12006 to 12706
   goals met: 12 of 15
55. (disembark-truck driver4 truck1 s6)
   deleted: (driving driver4 truck1)
   added: (at driver4 s6) (empty truck1)
   goals met: 13 of 15
56. (board-truck driver1 truck2 s10)
   deleted: (at driver1 s10) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 12 of 15
57. (drive-truck truck2 s10 s8 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s8)
   changed: (fuel-used) from 12706 to 13166
   goals met: 12 of 15
58. (drive-truck truck2 s8 s0 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   changed: (fuel-used) from 13166 to 13916
   goals met: 12 of 15
59. (load-truck package2 truck2 s0)
   deleted: (at package2 s0)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 12 of 15
60. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 12 of 15
61. (walk driver1 s0 p10-0)
   deleted: (at driver1 s0)
   added: (at driver1 p10-0)
   goals met: 12 of 15
62. (board-truck driver4 truck1 s6)
   deleted: (at driver4 s6) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 11 of 15
63. (drive-truck truck1 s6 s4 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (fuel-used) from 13916 to 14616
   goals met: 12 of 15
64. (drive-truck truck1 s4 s8 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s8)
   changed: (fuel-used) from 14616 to 14826
   goals met: 11 of 15
65. (walk driver1 p10-0 s10)
   deleted: (at driver1 p10-0)
   added: (at driver1 s10)
   goals met: 12 of 15
66. (drive-truck truck1 s8 s10 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s10)
   changed: (fuel-used) from 14826 to 15286
   goals met: 12 of 15
67. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 12 of 15
68. (drive-truck truck2 s0 s8 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   changed: (fuel-used) from 15286 to 16111
   goals met: 12 of 15
69. (unload-truck package2 truck2 s8)
   deleted: (in package2 truck2)
   added: (at package2 s8)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 13 of 15
70. (drive-truck truck1 s10 s1 driver4)
   deleted: (at truck1 s10)
   added: (at truck1 s1)
   changed: (fuel-used) from 16111 to 16651
   goals met: 13 of 15
71. (disembark-truck driver4 truck1 s1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s1) (empty truck1)
   goals met: 13 of 15
72. (walk driver4 s1 p1-6)
   deleted: (at driver4 s1)
   added: (at driver4 p1-6)
   goals met: 13 of 15
73. (walk driver4 p1-6 s6)
   deleted: (at driver4 p1-6)
   added: (at driver4 s6)
   goals met: 14 of 15
74. (drive-truck truck2 s8 s1 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   changed: (fuel-used) from 16651 to 16841
   goals met: 14 of 15
75. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 14 of 15
76. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 14 of 15
77. (drive-truck truck1 s1 s4 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 16841 to 17761
   goals met: 15 of 15
